In [1]:
import pandas as pd

In [2]:
df = pd.read_csv("data/rating-2023_new.csv")
df.head()

   Unnamed: 0  ship_to_id_emos  prod_id  final_rating
0           0          1338031    14746             1
1           1          1398033    14746             2
2           2          1518298    14746             1
3           3          1615951    14746             1
4           4          2385972    14746             2

In [4]:
df = df.drop('Unnamed: 0', axis=1)

In [5]:
df.head()

   ship_to_id_emos  prod_id  final_rating
0          1338031    14746             1
1          1398033    14746             2
2          1518298    14746             1
3          1615951    14746             1
4          2385972    14746             2

In [6]:
from datetime import datetime

df['timestamp'] = pd.to_datetime(datetime.now())
df.head()

   ship_to_id_emos  prod_id  final_rating                  timestamp
0          1338031    14746             1 2023-12-11 16:42:51.266081
1          1398033    14746             2 2023-12-11 16:42:51.266081
2          1518298    14746             1 2023-12-11 16:42:51.266081
3          1615951    14746             1 2023-12-11 16:42:51.266081
4          2385972    14746             2 2023-12-11 16:42:51.266081

In [7]:
df.tail(100)

         ship_to_id_emos  prod_id  final_rating                  timestamp
3720047           636506    10917             1 2023-12-11 16:42:51.266081
3720048           648976    10917             1 2023-12-11 16:42:51.266081
3720049           648977    10917             4 2023-12-11 16:42:51.266081
3720050           649194    10917             2 2023-12-11 16:42:51.266081
3720051           649226    10917             1 2023-12-11 16:42:51.266081
...                  ...      ...           ...                        ...
3720142          1814429    13003             1 2023-12-11 16:42:51.266081
3720143          3101224    13003             3 2023-12-11 16:42:51.266081
3720144          3254591    13003             2 2023-12-11 16:42:51.266081
3720145          3685523    13003             2 2023-12-11 16:42:51.266081
3720146          4399363    13003             2 2023-12-11 16:42:51.266081

[100 rows x 4 columns]

In [11]:
new_column_names = {
    'ship_to_id_emos': 'user_id:token',
    'prod_id': 'item_id:token',
    'final_rating': 'rating:float',
    'timestamp': 'timestamp:float',
}

# Renaming the columns
df.rename(columns=new_column_names, inplace=True)

In [12]:
df.head()

   user_id:token  item_id:token  rating:float            timestamp:float
0        1338031          14746             1 2023-12-11 16:42:51.266081
1        1398033          14746             2 2023-12-11 16:42:51.266081
2        1518298          14746             1 2023-12-11 16:42:51.266081
3        1615951          14746             1 2023-12-11 16:42:51.266081
4        2385972          14746             2 2023-12-11 16:42:51.266081

In [13]:
test_df = df[df['item_id:token'] == 10137]
test_df

         user_id:token  item_id:token  rating:float            timestamp:float
1362088        1007976          10137             1 2023-12-11 16:42:51.266081
1362089         104639          10137             2 2023-12-11 16:42:51.266081
1362090        1048762          10137             1 2023-12-11 16:42:51.266081
1362091        1054364          10137             1 2023-12-11 16:42:51.266081
1362092        1054396          10137             1 2023-12-11 16:42:51.266081
...                ...            ...           ...                        ...
1364765         993822          10137             3 2023-12-11 16:42:51.266081
1364766         993828          10137             3 2023-12-11 16:42:51.266081
1364767         993830          10137             1 2023-12-11 16:42:51.266081
1364768         993844          10137             3 2023-12-11 16:42:51.266081
1364769         993885          10137             1 2023-12-11 16:42:51.266081

[2682 rows x 4 columns]

In [14]:
len(df)

3720147

In [15]:
df.to_csv('output.inter', index=False, sep='\t', mode='w')

# Break

In [7]:
df = pd.read_csv("data/rating_recommendation_CF_new.csv")
df.head()

   prod_id  ship_to_id_emos  final_rating_e       prod_name
0    10137          4089037               1  F. SEASON MDCT
1    10137          4374491               1  F. SEASON MDCT
2    10137          1839333               1  F. SEASON MDCT
3    10137          1759124               1  F. SEASON MDCT
4    10137          4236989               1  F. SEASON MDCT

In [8]:
unique_ids = df.groupby('prod_id')['prod_name'].unique()

# Convert the Series back to a DataFrame
unique_df = unique_ids.reset_index()
unique_df['Unique_Products'] = unique_df['prod_name'].apply(lambda x: ', '.join(x))
unique_df = unique_df.drop(columns=['prod_name'])


unique_df.columns = ['prod_id:token', 'prod_name:token']

In [9]:
unique_df.head()

   prod_id:token prod_name:token
0          10137  F. SEASON MDCT
1          10138  NFDEO RO BRIGH
2          10139  GLISODIN 30 KA
3          10140  ENTRAMIX COKLA
4          10141  DANCOW 1+ Madu

In [10]:
with open('emos.item', 'w') as f:
    f.write(unique_df.to_string(index=False))

In [35]:
df['ship_to_id_emos'].unique()

array([4089037, 4374491, 1839333, ..., 2267399,  560804, 4220865])

In [4]:
len(df)

123205

In [3]:
df.columns

Index(['barcode', 'prod_code', 'prod_name', 'kodesubdist', 'uom',
       'class_product', 'kode_prin', 'composition', 'package', 'kode_brand',
       'efficacy', 'category_product', 'idproduct', 'classification_product',
       'name_prin', 'name_brand'],
      dtype='object')

In [19]:
count = df['classification_product'].str.contains('-').sum()

In [20]:
count

91

In [2]:
df = pd.read_csv("data/collaborative_filtering.csv")
df.head()

   userId                                   movie  rating
0       1  One Flew Over the Cuckoo's Nest (1975)       5
1       1        James and the Giant Peach (1996)       3
2       1                     My Fair Lady (1964)       3
3       1                  Erin Brockovich (2000)       4
4       1                    Bug's Life, A (1998)       5